## Phase 2 (Data Understanding): Embarked

* Autorin: Anna (i3-Versicherung)
* Webseite: [Data Science Training - Kapitel 4](https://data-science.training/kapitel-4/)
* Datum: 23.03.2023

Wir nehmen eine Schätzung für die beiden fehlenden Werte des Attributs Embarked vor.

In [4]:
# Pandas Paket (Package) importieren
#  Datenstrukturen und Datenanalyse, I/O
#  https://pandas.pydata.org/pandas-docs/stable/
import pandas as pd

In [5]:
# Trainings- und Testdaten als Pandas Data Frame (df) aus CSV-Dateien laden
#  (KNIME: "CSV Reader")
df_train = pd.read_csv('../../data/titanic/original/train.csv')
df_test  = pd.read_csv('../../data/titanic/original/test.csv')

In [6]:
# Trainings- und Testdaten zusammenführen
#  (KNIME "Concatenate")
df = pd.concat([df_train, df_test], ignore_index=True)

In [7]:
# Datentypen automatisch konvertieren
df = df.convert_dtypes()

In [8]:
# Fehlende Werte prüfen
df.isnull().sum()

PassengerId       0
Survived        418
Pclass            0
Name              0
Sex               0
Age             263
SibSp             0
Parch             0
Ticket            0
Fare              1
Cabin          1014
Embarked          2
dtype: int64

In [9]:
# Datensätze mit fehlendem Wert zu Embarked filtern und ausgeben
embarked_missing = df[df['Embarked'].isna()]
display(embarked_missing)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,<NA>
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,<NA>

In [10]:
# Gibt es noch weitere Passagiere, die mit der gleichen Ticketnummer gereist sind?
#  (Wenn ja, dann wären alle im gleichen Hafen an Bord gegangen.)
display(df[df['Ticket']=='113572'])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,<NA>
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,<NA>

### Ergebnis

* Es gibt nur zwei fehlende Werte zum Attribut Embarked (= Abfahrtshafen).
* Beide Passagiere sind mit der gleichen Ticket-Nummer gereist.
* Allerdings gibt es keine anderen Passagiere, die ebenfalls mit genau dieser Ticket-Nummer gereist sind.
* Die Namen der beiden Damen geben keinerlei Hinweis auf den Abfahrtshafen.
* Martha Evelyn Stone klingt englisch (=> Southampton).
* Amelie Icard klingt französisch (=> Cherbourg).
* Frau Icard könnte das Dienstmädchen von Frau Stone gewesen sein.
* Ein eindeutiger Hinweis auf einen Abfahrtshafen fehlt.
* Das Attribut Embarked ist nominalskaliert.
* Also nehmen wir als Schätzwert den Modus (häufigster Wert).
* Die meisten Passagiere sind in Southampton an Bord der Titanic gegangen (Embarked = 'S').